; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v2 ?v4)
             (pred_7 ?v3 ?v11)
             (pred_10 ?v2 ?v11)
             (pred_11 ?v7 ?v2 )
	     (pred_9 ?v2)
             (pred_1 ?v5)
             (pred_6 ?v3)
             (pred_4 ?v11)
             (pred_5 ?v2)
             (pred_3 ?v3)
             (pred_12 ?v2)
             (pred_8 ))



(:action op_1
:parameters (?v13 ?v10 ?v12 ?v6)
:precondition (and (pred_1 ?v13) (pred_1 ?v10) (pred_6 ?v12) (pred_4 ?v6)
          (pred_2 ?v13 ?v10) (pred_7 ?v12 ?v6)
                   (pred_10 ?v10 ?v6) (pred_9 ?v13) 
                   (pred_5 ?v10) (pred_3 ?v12))
:effect (and  (pred_12 ?v10) (not (pred_5 ?v10))))


(:action op_4
:parameters (?v13 ?v9)
:precondition (and (pred_1 ?v13) (pred_1 ?v9)
               (pred_9 ?v13) (pred_2 ?v13 ?v9) (pred_12 ?v9))
:effect (and (pred_9 ?v9) (not (pred_9 ?v13))))

(:action op_2
:parameters (?v13 ?v12)
:precondition (and (pred_1 ?v13) (pred_6 ?v12) 
                  (pred_9 ?v13) (pred_11 ?v12 ?v13) (pred_8 ))
:effect (and (pred_3 ?v12)
   (not (pred_11 ?v12 ?v13)) (not (pred_8 ))))


(:action op_3
:parameters (?v13 ?v1 ?v8)
:precondition (and (pred_1 ?v13) (pred_6 ?v1) (pred_6 ?v8)
                  (pred_9 ?v13) (pred_3 ?v8) (pred_11 ?v1 ?v13))
:effect (and (pred_3 ?v1) (pred_11 ?v8 ?v13)
        (not (pred_3 ?v8)) (not (pred_11 ?v1 ?v13))))

(:action op_5
:parameters (?v13 ?v12)
:precondition (and (pred_1 ?v13) (pred_6 ?v12) 
                  (pred_9 ?v13) (pred_3 ?v12))
:effect (and (pred_8 ) (pred_11 ?v12 ?v13) (not (pred_3 ?v12)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_15 obj_09 obj_06 obj_18 obj_10 obj_01 obj_16 obj_20 obj_17 obj_02 obj_21 obj_11 obj_22 obj_19 obj_07
    obj_04 obj_05 obj_08
    obj_12 obj_13 obj_14
    )

    (:init
       (pred_8)

       (pred_1 obj_03)
       (pred_1 obj_15)
       (pred_1 obj_09)
       (pred_1 obj_06)
       (pred_1 obj_18)
       (pred_1 obj_10)
       (pred_1 obj_01)
       (pred_1 obj_16)
       (pred_1 obj_20)
       (pred_1 obj_17)
       (pred_1 obj_02)
       (pred_1 obj_21)
       (pred_1 obj_11)
       (pred_1 obj_22)
       (pred_1 obj_19)
       (pred_1 obj_07)
       (pred_4 obj_04)
       (pred_4 obj_05)
       (pred_4 obj_08)
       (pred_6 obj_12)
       (pred_6 obj_13)
       (pred_6 obj_14)

       (pred_2 obj_03 obj_18)
       (pred_2 obj_03 obj_15)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_15 obj_09)
       (pred_2 obj_15 obj_03)
       (pred_2 obj_09 obj_01)
       (pred_2 obj_09 obj_06)
       (pred_2 obj_09 obj_15)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_06 obj_09)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_18 obj_10)
       (pred_2 obj_18 obj_03)
       (pred_2 obj_10 obj_17)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_10 obj_18)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_01 obj_16)
       (pred_2 obj_01 obj_09)
       (pred_2 obj_01 obj_10)
       (pred_2 obj_16 obj_21)
       (pred_2 obj_16 obj_06)
       (pred_2 obj_16 obj_01)
       (pred_2 obj_20 obj_11)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_17 obj_22)
       (pred_2 obj_17 obj_02)
       (pred_2 obj_17 obj_10)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_02 obj_19)
       (pred_2 obj_02 obj_21)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_02 obj_17)
       (pred_2 obj_21 obj_07)
       (pred_2 obj_21 obj_16)
       (pred_2 obj_21 obj_02)
       (pred_2 obj_11 obj_22)
       (pred_2 obj_11 obj_20)
       (pred_2 obj_22 obj_19)
       (pred_2 obj_22 obj_17)
       (pred_2 obj_22 obj_11)
       (pred_2 obj_19 obj_07)
       (pred_2 obj_19 obj_02)
       (pred_2 obj_19 obj_22)
       (pred_2 obj_07 obj_21)
       (pred_2 obj_07 obj_19)
       (pred_5 obj_21)
       (pred_5 obj_11)
       (pred_5 obj_02)
       (pred_10  obj_21 obj_04)
       (pred_10  obj_11 obj_05)
       (pred_10  obj_02 obj_08)
       (pred_12 obj_03)
       (pred_12 obj_15)
       (pred_12 obj_09)
       (pred_12 obj_06)
       (pred_12 obj_18)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_16)
       (pred_12 obj_20)
       (pred_12 obj_17)
       (pred_12 obj_22)
       (pred_12 obj_19)
       (pred_12 obj_07)

       (pred_7  obj_12 obj_04)
       (pred_7  obj_13 obj_05)
       (pred_7  obj_14 obj_08)
       (pred_11 obj_12 obj_07)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_14 obj_07)
       (pred_9 obj_07)
    )

    (:goal (and
       (pred_11 obj_12 obj_03)
    ))
(:constraints
  (always (not (pred_9 obj_10)))
)
)

; plan
1. (op_2 obj_07 obj_12)
   deleted: (pred_11 obj_12 obj_07) (pred_8)
   added: (pred_3 obj_12)
   goals met: 0 of 1
2. (op_4 obj_07 obj_19)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_19)
   goals met: 0 of 1
3. (op_4 obj_19 obj_22)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_22)
   goals met: 0 of 1
4. (op_4 obj_22 obj_17)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_17)
   goals met: 0 of 1
5. (op_4 obj_17 obj_20)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_20)
   goals met: 0 of 1
6. (op_4 obj_20 obj_18)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_18)
   goals met: 0 of 1
7. (op_4 obj_18 obj_03)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_03)
   goals met: 0 of 1
8. (op_5 obj_03 obj_12)
   deleted: (pred_3 obj_12)
   added: (pred_8) (pred_11 obj_12 obj_03)
   goals met: 1 of 1
